vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
	// } while((towrite > 0) && (writelen >= 0));
    // ==== flash write logic ====
	printf("[OTA] set OTA partition length\r\n");
	ptEntry.len = total;
	// printf("[OTA] [TCP] Update PARTITION, partition len is %lu\r\n", ptEntry.len);
	hal_boot2_update_ptable(&ptEntry);
	puts("[OTA] Rebooting...\r\n");
    sys_msleep(500);
	vPortFree(recv_buffer);
	bl_mtd_close(handle);
    hal_reboot();
    return ERR_OK;
}

// 0   1   3  4
// 20  21  3  4
const int pwm_to_pin[4][2] = {{0,20},{1,21},{3,3},{4,4}};
const int map[] = {0,1,2,3};

err_t httpd_handler(struct netconn *conn) {
    struct netbuf *inbuf;
    char *buf;
    u16_t buflen;

    // Receive HTTP request
    if (netconn_recv(conn, &inbuf) == ERR_OK) {
        netbuf_data(inbuf, (void **)&buf, &buflen);
        
        printf("HTTP Length: %i\n", buflen);
        printf("HTTP Request: %s\n\n", buf);

        // Check if the request is a POST (for file upload)
        if (strncmp(buf, "POST ", 5) == 0) {
            puts("[httpd_handler] Handling POST request...\n");
            int content_length = 0;
            // Parse Content-Length header
            char *content_length_str = strstr(buf, "Content-Length:");
            if (content_length_str) {
                sscanf(content_length_str, "Content-Length: %d", &content_length);
                printf("Content-Length header found: %d\n", content_length);
            } else {
                puts("Content-Length header not found\n");
            }
            if(strncmp(buf, "POST /ota", 9) == 0) {
                netbuf_delete(inbuf);
                puts("[httpd_handler] Handling firmware upload...\n");
                // I KNOW I'M SENDING the firmware now
                // Parse and handle the firmware data
                if (http_rest_post_flash(conn, content_length) != ERR_OK) {
                    const char *error_response =
                        "HTTP/1.1 500 Internal Server Error\r\n"
                        "Connection: close\r\n\r\n"
                        "Failed to process firmware upload.";
                    netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
                } else {
                    const char *success_response =
                        "HTTP/1.1 200 OK\r\n"
                        "Connection: close\r\n\r\n"
                        "Firmware uploaded successfully.";
                    netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
                }
            } else if (strncmp(buf, "POST /wifi", 10) == 0) {
                puts("[httpd_handler] Handling wifi settings request...\n");
                char* body = malloc(content_length + 1);
                char* body_start = strstr(buf, "\r\n\r\n");
                body_start += 4;
                char* body_end = buf + buflen;
                int total_length = body_end - body_start;
                printf("Total length: %i\r\n", total_length);
                memcpy(body, body_start, total_length);
                netbuf_delete(inbuf);
                if (netconn_recv(conn, &inbuf) == ERR_OK) {
                    puts("Got additional data\r\n");
                    netbuf_data(inbuf, (void **)&buf, &buflen);
                    printf("Additional data length: %i\r\n", buflen);
                    memcpy(body + total_length, buf, buflen);
                }
                body[content_length] = '\0';
                printf("Body: %s\r\n", body);
                if (http_rest_post_wifi(body) != ERR_OK) {
                    const char *error_response =
                        "HTTP/1.1 500 Internal Server Error\r\n"
                        "Connection: close\r\n\r\n"
                        "Failed to process new wifi settings.";
                    netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
                } else {
                    const char *success_response =
                        "HTTP/1.1 200 OK\r\n"
                        "Connection: close\r\n\r\n"
                        "Changed wifi settings.";
                    netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
                }
                netbuf_delete(inbuf);
                free(body);
            }
            else if (strncmp(buf, "POST /pwm_start", 15) == 0) {
                puts("[httpd_handler] Starting pwm\n");
                char* body = malloc(content_length + 1);
                char* body_start = strstr(buf, "\r\n\r\n");
                body_start += 4;
                char* body_end = buf + buflen;
                int total_length = body_end - body_start;
                printf("Total length: %i\r\n", total_length);
                memcpy(body, body_start, total_length);
                netbuf_delete(inbuf);
                if (netconn_recv(conn, &inbuf) == ERR_OK) {
                    puts("Got additional data\r\n");
                    netbuf_data(inbuf, (void **)&buf, &buflen);
                    printf("Additional data length: %i\r\n", buflen);
                    memcpy(body + total_length, buf, buflen);
                }
                body[content_length] = '\0';
                printf("[httpd_handler] body: %s\r\n", body);
                char* start = strstr(body, "name=\"pin_id\"\r\n\r\n");
                start += 14;
                int pin = atoi(start);
                printf("[httpd_handler] pwm pin: %d\r\n", pin);
                start = strstr(body, "name=\"duty\"\r\n\r\n");
                start += 15;
                int duty = atoi(start);
                int id = pwm_to_pin[pin][0];
                bl_pwm_set_duty(id, duty);
                netbuf_delete(inbuf);
            }  
            else if (strncmp(buf, "POST /pwm_edit_duty", 19) == 0) {
            }  
            else if (strncmp(buf, "POST /pwm_stop", 14) == 0) {
                puts("[httpd_handler] Stopping pwm\n");
                // bl_pwm_stop(id);
                netbuf_delete(inbuf);
            } 
            else netbuf_delete(inbuf);
        } else {
            // Default response (serves an HTML page)
            const char *response =
                "HTTP/1.1 200 OK\r\n"
                "Content-Type: text/html\r\n"
                "Connection: close\r\n\r\n";
            netconn_write(conn, response, strlen(response), NETCONN_COPY);
            netconn_write(conn, html_page, strlen(html_page), NETCONN_COPY);
            netbuf_delete(inbuf);
        }
    }

